{
"cs":{
  "title1": "Mladý tým s vášní pro technologie",
  "text1": "V Arvionu jsme mladý tým nadšenců, kteří se nebojí zajímavých a náročných úkolů. Naší vášní je vytvářet inovativní a efektivní softwarová řešení, která skutečně pomohou našim klientům. Snažíme se porozumět specifickým potřebám každé firmy a přizpůsobit naše služby tak, aby přinášely co největší hodnotu.",
  "title2": "Naším cílem je růst našich klientů",
  "text2": "Věříme, že dobrý software může významně zjednodušit procesy, zlepšit efektivitu a podpořit růst podniků. Naším cílem je nejen poskytovat kvalitní řešení, ale také budovat dlouhodobé vztahy s našimi zákazníky, kterým se vždy snažíme vycházet vstříc.",
  "title3": "Výzvy přijímáme s nadšením",
  "text3": "Každý projekt pro nás představuje výzvu, kterou přijímáme s nadšením a profesionalitou. Společně dosahujeme cílů, které mění věci k lepšímu.",
  "button": 
    [{
      "title": "Kontaktujte nás",
      "scrollToSection": "/contact",
      "color": "#fff"
    }]
},
"en": {
  "title1": "A Young Team Passionate About Technology",
  "text1": "At Arvion, we are a young team of enthusiasts who are not afraid of interesting and challenging tasks. Our passion is to create innovative and efficient software solutions that truly help our clients. We strive to understand the specific needs of each business and tailor our services to bring the most value possible.",
  "title2": "Our Goal is to Help Our Clients Grow",
  "text2": "We believe that good software can significantly streamline processes, improve efficiency, and support business growth. Our goal is not only to provide quality solutions but also to build long-term relationships with our customers, always striving to meet their needs.",
  "title3": "We Embrace Challenges Enthusiastically",
  "text3": "We approach every project as an opportunity for challenge and growth, tackling it with enthusiasm and professionalism. Together, we achieve goals that make a positive difference.",
  "button": 
    [{
      "title": "Contact Us",
      "scrollToSection": "/contact",
      "color": "#fff"
    }]
}
}
